app/views/shared/_user_info.html.erb

<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.microposts.count, "verse") %></span>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 1]]