app/controllers/users_controller.rb

  def index
    #Original with 30 per page limit
    #@users = User.paginate(page: params[:page])
    @users = User.where(activated: true).paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."activated" = $1 LIMIT 30 OFFSET 0  [["activated", "t"]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = $1  [["activated", "t"]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"